@extends('layouts.index')
@vite(['resources/sass/reference_overview.scss'])
@section('title', 'Огляд')
@section('content')
    <div class="main">
        <div class="main__container">
            <div class="main__links-container">
                <div class="main__link section--active">Огляд</div>
                <a href="{{route('reference.people.index')}}" class="main__link">Люди</a>
            </div>
            <div class="main__description">Короткий вступ до програмного забезпечення для обробки та проектів від
                спільноти.
            </div>

            <div class="main__content">
                <h2 class="main__sub-title">Огляд</h2>
                <p>
                    9 серпня 2021 року ми відсвяткували двадцяту річницю першого випуску програмного забезпечення
                    Processing.
                    Протягом цього часу
                    ми просували програмну грамотність, особливо в образотворчому мистецтві, та візуальну грамотність у
                    технологій. Спочатку
                    створений як програмний скетчбук для навчання основам програмування у візуальному контексті,
                    Processing
                    також перетворився на інструмент розробки для професіоналів. Програмне забезпечення Processing
                    завжди
                    було безкоштовним
                    і
                    з відкритим вихідним кодом і
                    завжди працювало на Mac OS, Windows та Linux.
                </p>
                <p>
                    Обробка продовжує залишатися альтернативою пропрієтарним програмним засобам з обмеженими і дорогими
                    ліцензіями, що робить
                    його доступним для шкіл та окремих учнів. Її безкоштовний, вільний, відкритий статус заохочує
                    спільнота
                    участь і співпрацю, що є життєво важливими для її розвитку. Дописувачі діляться програмами, надають
                    код і створюють
                    бібліотеки, інструменти та режими для розширення можливостей програмного забезпечення. Спільнота
                    Processing вже написала
                    написала понад
                    сотні бібліотек для комп'ютерного зору, візуалізації даних, написання музики, роботи в мережі,
                    експорту
                    3D-файлів
                    експорту 3D-файлів та
                    програмування електроніки.
                </p>
                <p>
                    Від самого початку Processing була розроблена так, щоб бути максимально простою для початківців,
                    знаючи,
                    що її простота
                    також принесе користь і більш досвідченим користувачам. Він був натхненний простотою попередніх мов,
                    таких як BASIC та
                    Logo, а також нашим досвідом навчання кодуванню та викладання кодування для широкого кола
                    користувачів.
                    Ті самі
                    елементи, що вивчаються на початкових курсах інформатики в старших класах середньої школи чи
                    університеті, викладаються
                    в Processing, але з іншим акцентом. Оскільки він зосереджений на створенні візуальних, інтерактивних
                    медіа,
                    студенти-початківці в програмуванні отримують задоволення від того, що щось з'являється на їхньому
                    екрані за мить після
                    використання програмного забезпечення. Цей мотивуючий навчальний план виявився успішним для
                    залучення
                    студентів дизайну,
                    мистецтва та архітектури до програмування, а також для залучення ширшого кола студентів до загальних
                    занять з
                    інформатики.
                </p>
                <p>
                    Програму Processing використовують у навчальних класах по всьому світу, часто в школах мистецтв та
                    на
                    програмах з
                    образотворчого мистецтва в університетах, але її також часто можна зустріти в середніх школах, на
                    програмах з
                    інформатики та в гуманітарних навчальних програмах. В опитуванні, проведеному Національним науковим
                    фондом, студенти
                    вступного курсу з комп'ютерних наук у коледжі Брин-Мор заявили, що вони вдвічі частіше відвідують
                    інші
                    заняття з
                    інформатики, ніж студенти, які навчаються за більш традиційною програмою. Підхід Processing також
                    був
                    застосований до
                    електроніки через проекти з електропроводки та Arduino. Ці проекти використовують модифіковану
                    версію
                    середовища
                    програмування Processing, щоб полегшити учням навчання програмуванню роботів і незліченних інших
                    електронних проектів.
                </p>
                <p>
                    Програмне забезпечення Processing використовують тисячі візуальних дизайнерів, художників та
                    архітекторів для створення
                    своїх робіт. Такі музеї, як Exploratorium у Сан-Франциско, використовують Processing для розробки
                    своїх
                    виставок.
                    Проекти, створені за допомогою Processing, були представлені в Музеї сучасного мистецтва в
                    Нью-Йорку,
                    Музеї Вікторії та
                    Альберта в Лондоні, Центрі Жоржа Помпіду в Парижі та багатьох інших відомих місцях. Processing
                    використовується для
                    створення спроектованих сценічних конструкцій для танцювальних і музичних виступів; для створення
                    зображень для музичних
                    кліпів і фільмів; для експорту зображень для плакатів, журналів і книг; для створення інтерактивних
                    інсталяцій в
                    галереях, музеях і на вулицях. Але найважливіше в Processing and Culture - це не гучні результати, а
                    те,
                    як це програмне
                    забезпечення заохотило нове покоління візуальних митців розглядати програмування як невід'ємну
                    частину
                    їхньої творчої
                    практики.
                </p>
                <p>
                    Ми заснували Processing Foundation у 2012 році, щоб підтримати розробку програмного забезпечення та
                    дати
                    можливість
                    людям з різними інтересами та досвідом навчитися програмувати та творчо працювати з кодом, особливо
                    тим,
                    хто інакше не
                    мав би доступу до цих інструментів та ресурсів. Ми робимо це, розробляючи та розповсюджуючи групу
                    пов'язаних програмних
                    проектів та сприяючи партнерству та співпраці з суміжними організаціями та окремими особами, щоб
                    створити більш
                    різноманітну спільноту навколо програмного забезпечення та мистецтва. Більше інформації про Фонд
                    можна
                    знайти на <a target="_blank" href="https://processingfoundation.org/">сайті
                        Processing Foundation.</a>
                </p>
                <p>
                    Коли ми почали працювати над Processing навесні 2001 року, ми обидва були аспірантами в
                    Медіалабораторії
                    Массачусетського технологічного інституту в дослідницькій групі Джона Маеда "Естетика та
                    обчислення".
                    Розробка
                    продовжувалася у вільний час, поки Кейсі займався мистецтвом і викладацькою кар'єрою, а Бен здобував
                    докторську ступінь
                    і заснував Fathom Information Design. Багато ідей у Processing сягають корінням до "Майстерні
                    візуальної
                    мови" Мюріель
                    Купер, а сам проект виріс безпосередньо з проекту Маеда "Дизайн за допомогою чисел", розробленого в
                    Медіалабораторії та
                    випущеного в 1999 році. <a target="_blank"
                                               href="https://medium.com/processing-foundation/a-modern-prometheus-59aed94abe85">
                        Ми запрошуємо вас
                        прочитати нашу довшу історію Processing на
                        Medium.</a>
                </p>
                <p>— Бен Фрай та Кейсі Ріс, оновлено 14 вересня 2022 року</p>
                <h2 class="main__sub-title">Дякуємо вам.</h2>
                <p>YourKit підтримує Обробку, надаючи свій повнофункціональний Java Profiler. YourKit, LLC - розробник
                    інструментів для
                    профілювання Java та .NET додатків: <a target="_blank"
                                                           href="https://www.yourkit.com/java/profiler/index.jsp">YourKit
                        Java Profiler</a>, <a target="_blank" href="https://www.yourkit.com/dotnet-profiler/features/">
                        YourKit .NET
                        Profiler</a>.</p>
            </div>
        </div>
    </div>
@endsection
